tutorials/RAS/Sumer2011/0_org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rbgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    rightWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    lowerWallSmooth
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    lowerWallRough
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    cfrontWall
    {
        type            empty;
    }
    cbackWall
    {
        type            empty;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U.fluid;
        phi             phi.fluid;
        rho             rhof;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
