tutorials/RAS/Sumer2011/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1 ;//convertToMeters 1.0;

vertices
(
    (-6    0       0 )    // 0 
    ( 6    0       0 )    // 1
    ( 6.012  0.000857   0 )    // 2    ( 9.6  0.266   0 )    // 2
    ( 13.8 0.5572   0 )    // 3
    ( 15   0.643   0 )    // 4

    ( 15   0.80    0 )    // 5
    ( 13.8 0.80    0 )    // 6
    ( 6.012  0.80    0 )    // 7
    ( 6    0.80    0 )    // 8
    (-6    0.80    0 )   // 9


    (-6    0       0.2 )    // 10
    ( 6    0       0.2 )    // 11
    ( 6.012  0.000857   0.2 )    // 12
    ( 13.8 0.5572   0.2 )    // 13
    ( 15   0.643   0.2 )    // 14

    ( 15   0.80  0.2 )   // 15
    ( 13.8 0.80  0.2 )    // 16
    ( 6.012  0.80  0.2 )    // 17
    ( 6    0.80  0.2 )    // 18
    (-6    0.80  0.2 )    // 19

    // Trapezoidal Groove (  0.1 m deep - from 7.8 to 13.8 m along the slope with 45 degree angle ) 
    
    ( 6.012   -0.1468    0 )    // 20
    ( 13.8  0.51265  0 )    // 21
    ( 6.012   -0.1468   0.2 )    // 22
    ( 13.8  0.51265   0.2 )    // 23
);

blocks
(
    hex (0 1 8 9 10 11 18 19) (1000 55 1) simpleGrading (1 9 1)
    hex (1 2 7 8 11 12 17 18) (1 55 1) simpleGrading (1 9 1)
    hex (2 3 6 7 12 13 16 17) (649 55 1) simpleGrading (1 9 1) //  hex (2 3 6 7 12 13 16 17) (75 36  1) simpleGrading (1 9 1)  //    hex (2 3 6 7 12 13 16 17) (75 55 1) simpleGrading (1 9 1)
    hex (3 4 5 6 13 14 15 16) (100 55 1) simpleGrading (1 9 1) //  hex (3 4 5 6 13 14 15 16) (375 32 1) simpleGrading (1 9 1)   // hex (3 4 5 6 13 14 15 16) (375 55 1) simpleGrading (1 9 1)
  //Groove
    hex (20 21 3 2 22 23 13 12) (649 37 1) simpleGrading (1 1 1) //( 1 9 1)  //    hex (20 21 3 2 22 23 13 12) (75 55 1) simpleGrading (1 9 1) //( 1 9 1)


);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 10 19 9)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (4 5 15 14)
        );
    }
    lowerWallSmooth
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (1 2 12 11)
            (2 20 22 12)
            (20 21 23 22)
            (3 21 23 13)
          //(2 3 13 12)
            (3 4 14 13)

        );
    }
//    lowerWallRough
//    {
//        type wall;
//        faces
//        (
//            (1 2 8 7)
//        );
//    }
    cfrontWall
    {
        type empty;
        faces
        (
            (0 9 8 1)
            (1 8 7 2)
            (2 7 6 3)
            (2 3 21 20)
            (3 6 5 4)

        );
//        neighbourPatch  cbackWall;
    }
    cbackWall
    {
        type empty;
        faces
        (
            (10 11 18 19)
            (11 12 17 18)
            (12 13 16 17)
            (22 23 13 12)
            (13 14 15 16)

        );
//        neighbourPatch  cfrontWall;
    }
    atmosphere
    {
        type patch;
        faces
        (
            (9 19 18 8)
            (8 18 17 7)
            (7 17 16 6)
            (6 16 15 5)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
