tutorials/RAS/Sumer2011/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}
////////////////////////////////////////////////////////////////////////////////
    castellatedMesh true;
    snap true;       // snap back to surface?>
    addLayers true; // add viscous layer?
///////////////////////////////////////////////////////////////////////
    geometry
    {
        lowerWallRough.stl
        {
            type triSurfaceMesh;
            name lowerWallRough;
            appendRegionName true;
        }

        waterSurfaceRefinementBox
        {
            type searchableBox;
            min (-6 0.3 0  );
            max (15 0.5 0.6);
        }

//        btmRefinementBoxAt1And2
//        {
//            type searchableBox;
//            min (10.60 0.340 0  );
//            max (10.72 0.349 0.6);
//        }

    }
///////////////////////////////////////////////////////////
    castellatedMeshControls
    {
        features
        (
            {
                file "lowerWallRough.eMesh";
                level 2;
            }        
        );
        refinementSurfaces
        {
            lowerWallRough
            {
                level (2 2);
            }
        }

        refinementRegions
        {
            waterSurfaceRefinementBox
            {
                mode inside;
                levels ((1E15 1));
            }
        }


//        refinementRegions
//        {
//            btmRefinementBoxAt1And2
//            {
//                mode inside;
//                levels ((1E15 5));
//            }
//        }

        locationInMesh (5 0.2 0.001);
        maxLocalCells 10000000; // max cells per CPU core --> 1 million
        maxGlobalCells 20000000;
        minRefinementCells 0;
        nCellsBetweenLevels 2;
        resolveFeatureAngle 30;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 30;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }
    addLayersControls
    {

        relativeSizes false;

        layers
        {
            lowerWallRough 
            {
                nSurfaceLayers 3;
                expansionRatio 1;
                finalLayerThickness 0.0015;
            }
        }

        expansionRatio 1;
        finalLayerThickness 0.0015;
//        firstLayerThickness 0.0005;
        minThickness 0.0001;
        nGrow 0;
        featureAngle 180;
        slipFeatureAngle 30;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 65;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality 1e-15;
        minArea -1;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed
        {
            maxNonOrtho 75;
        }

    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
